import { Conjugation } from '../model/Conjugation';

export const conjugations: Conjugation[] = [

    // lekcja 1 i 2
    {base: 'сидеть', ru: ['сижу', 'сидишь', 'сидит', 'сидим', 'сидите', 'сидят']},
    {base: 'учиться', ru: ['учусь', 'учишься', 'учится', 'учимся', 'учитесь', 'учатся']},
    {base: 'радоваться', ru: ['радуюсь', 'радуешься', 'радуется', 'радуемся', 'радуетесь', 'радуются']},
    {base: 'слушать', ru: ['слушаю', 'слушаешь', 'слушает', 'слушаем', 'слушаете', 'слушают']},
    {base: 'приезжать', ru: ['приеду', 'приедешь', 'приедет', 'приедем', 'приедете', 'приедут']},
    {base: 'любить', ru: ['люблю', 'любишь', 'любит', 'любим', 'любите', 'любят']},
    {base: 'подружиться', ru: ['подружусь', 'подружишься', 'подружится', 'подружимся', 'подружитесь', 'подружатся']},
    {base: 'взять', ru: ['возьму', 'возьмёшь', 'возьмёт', 'возьмём', 'возьмёте', 'возьмут']},
    {base: 'навестить', ru: ['навещу', 'навестишь', 'навестит', 'навестим', 'навестите', 'навестят']},
    {base: 'быть', ru: ['буду', 'будешь', 'будет', 'будем', 'будете', 'будут']},
    {base: 'жить', ru: ['живу', 'живёшь', 'живёт', 'живём', 'живёте', 'живут']},
    {base: 'волноваться', ru: ['волнуюсь', 'волнуешься', 'волнуется', 'волнуемся', 'волнуетесь', 'волнуются']},
    {base: 'знать', ru: ['знаю', 'знаешь', 'знает', 'знаем', 'знаете', 'знают']},
    {base: 'ехать', ru: ['еду', 'едешь', 'едет', 'едем', 'едете', 'едут']},
    {base: 'понравиться', ru: ['понравлюсь', 'понравишься', 'понравится', 'понравимся', 'понравитесь', 'понравятся']},

    //lekcja 3
    {base: 'везти', ru: ['везу', 'везёшь', 'везёт', 'везём', 'везёте', 'везут']},
    {base: 'закрыть', ru: ['закрою', 'закроешь', 'закроет', 'закроем', 'закроете', 'закроют']},
    {base: 'представить', ru: ['предъявлю', 'предъявишь', 'предъявит', 'предъявим', 'предъявите', 'предъявят']},

    // lekcja 4
    {base: 'видеться', ru: ['вижусь', 'видишься', 'видится', 'видимся', 'видитесь', 'видятся']},
    {base: 'дать', ru: ['дам', 'дашь', 'даст', 'дадим', 'дадите', 'дадут']},
    {base: 'идти', ru: ['иду', 'идёшь', 'идёт', 'идём', 'идёте', 'идут']},
    {base: 'изменится', ru: ['изменюсь', 'изменишься', 'изменится', 'изменимся', 'изменитесь', 'изменятся']},
    {base: 'скучать', ru: ['скучаю', 'скучаешь', 'скучает', 'скучаем', 'скучаете', 'скучают']},
    {base: 'соскучиться', ru: ['соскучусь', 'соскучишься', 'соскучится', 'соскучимся', 'соскучитесь', 'соскучатся']},
]