import { Conjugation } from '../model/Conjugation';

export const conjugations: Conjugation[] = [
    {base: 'видеться', ru: ['вижусь', 'видишься', 'видится', 'видимся', 'видитесь', 'видятся']},
    {base: 'дать', ru: ['дам', 'дашь', 'даст', 'дади́м', 'дадите', 'дадут']},
    {base: 'идти', ru: ['иду', 'идёшь', 'идёт', 'идём', 'идёте', 'идут']},
    {base: 'изменится', ru: ['изменюсь', 'изменишься', 'изменится', 'изменимся', 'изменитесь', 'изменятся']},
    {base: 'скучать', ru: ['скучаю', 'скучаешь', 'скучает', 'скучаем', 'скучаете', 'скучают']},
    {base: 'соскучиться', ru: ['соску́чусь', 'соску́чишься', 'соску́чится', 'соску́чимся', 'соску́читесь', 'соску́чатся']},
]