import { Conjugation } from '../model/Conjugation';

export const conjugations: Conjugation[] = [

    // lekcja 1
    {base: 'быть', ru: ['буду', 'будешь', 'будет', 'будем', 'будете', 'будут']},
    {base: 'волноваться', ru: ['волнуюсь', 'волнуешься', 'волнуется', 'волнуемся', 'волнуетесь', 'волнуются']},
    {base: 'ехать', ru: ['еду', 'едешь', 'едет', 'едем', 'едете', 'едут']},
    {base: 'жить', ru: ['живу', 'живёшь', 'живёт', 'живём', 'живёте', 'живут']},
    {base: 'знать', ru: ['знаю', 'знаешь', 'знает', 'знаем', 'знаете', 'знают']},
    {base: 'понравиться', ru: ['понравлюсь', 'понравишься', 'понравится', 'понравимся', 'понравитесь', 'понравятся']},

    // lekcja 2
    {base: 'взять', ru: ['возьму', 'возьмёшь', 'возьмёт', 'возьмём', 'возьмёте', 'возьмут']},
    {base: 'гулять', ru: ['гуляю', 'гуляешь', 'гуляет', 'гуляем', 'гуляете', 'гуляют']},
    {base: 'любить', ru: ['люблю', 'любишь', 'любит', 'любим', 'любите', 'любят']},
    {base: 'навестить', ru: ['навещу', 'навестишь', 'навестит', 'навестим', 'навестите', 'навестят']},
    {base: 'подружиться', ru: ['подружусь', 'подружишься', 'подружится', 'подружимся', 'подружитесь', 'подружатся']},
    {base: 'приезжать', ru: ['приеду', 'приедешь', 'приедет', 'приедем', 'приедете', 'приедут']},
    {base: 'работать', ru: ['работаю', 'работаешь', 'работает', 'работаем', 'работаете', 'работают']},
    {base: 'радоваться', ru: ['радуюсь', 'радуешься', 'радуется', 'радуемся', 'радуетесь', 'радуются']},
    {base: 'сидеть', ru: ['сижу', 'сидишь', 'сидит', 'сидим', 'сидите', 'сидят']},
    {base: 'слушать', ru: ['слушаю', 'слушаешь', 'слушает', 'слушаем', 'слушаете', 'слушают']},
    {base: 'учиться', ru: ['учусь', 'учишься', 'учится', 'учимся', 'учитесь', 'учатся']},

    //lekcja 3
    {base: 'везти', ru: ['везу', 'везёшь', 'везёт', 'везём', 'везёте', 'везут']},
    {base: 'закрыть', ru: ['закрою', 'закроешь', 'закроет', 'закроем', 'закроете', 'закроют']},
    {base: 'открыть', ru: ['открою', 'откроешь', 'откроет', 'откроем', 'откроете', 'откроют']},
    {base: 'представить', ru: ['предъявлю', 'предъявишь', 'предъявит', 'предъявим', 'предъявите', 'предъявят']},

    // lekcja 4
    {base: 'видеться', ru: ['вижусь', 'видишься', 'видится', 'видимся', 'видитесь', 'видятся']},
    {base: 'встречать', ru: ['встречаю', 'встречаешь', 'встречает', 'встречаем', 'встречаете', 'встречают']},
    {base: 'говорит', ru: ['говорю', 'говоришь', 'говорит', 'говорим', 'говорите', 'говорят']},
    {base: 'дать', ru: ['дам', 'дашь', 'даст', 'дадим', 'дадите', 'дадут']},
    {base: 'ждать', ru: ['жду', 'ждёшь', 'ждёт', 'ждём', 'ждёте', 'ждут']},
    {base: 'идти', ru: ['иду', 'идёшь', 'идёт', 'идём', 'идёте', 'идут']},
    {base: 'изменится', ru: ['изменюсь', 'изменишься', 'изменится', 'изменимся', 'изменитесь', 'изменятся']},
    {base: 'нести', ru: ['несу', 'несёшь', 'несёт', 'несём', 'несёте', 'несут']},
    {base: 'отпустить', ru: ['отпущу', 'отпустишь', 'отпустит', 'отпустим', 'отпустите', 'отпустят']},
    {base: 'печь', ru: ['пеку', 'печёшь', 'печёт', 'печём', 'печёте', 'пекут']},
    {base: 'поздороваться', ru: ['поздороваюсь', 'поздороваешься', 'поздоровается', 'поздороваемся', 'поздороваетесь', 'поздороваются']},
    {base: 'помочь', ru: ['помогу', 'поможешь', 'поможет', 'поможем', 'поможете', 'помогут']},
    {base: 'прочитать', ru: ['прочитаю', 'прочитаешь', 'прочитает', 'прочитаем', 'прочитаете', 'прочитают']},
    {base: 'рисовать', ru: ['рисую', 'рисуешь', 'рисует', 'рисуем', 'рисуете', 'рисуют']},
    {base: 'слышать', ru: ['слышу', 'слышишь', 'слышит', 'слышим', 'слышите', 'слышат']},
    {base: 'скучать', ru: ['скучаю', 'скучаешь', 'скучает', 'скучаем', 'скучаете', 'скучают']},
    {base: 'соскучиться', ru: ['соскучусь', 'соскучишься', 'соскучится', 'соскучимся', 'соскучитесь', 'соскучатся']},
    {base: 'стоять', ru: ['стою', 'стоишь', 'стоит', 'стоим', 'стоите', 'стоят']},
    {base: 'узнать', ru: ['узнаю', 'узнаешь', 'узнает', 'узнаем', 'узнаете', 'узнают']},
    {base: 'устать', ru: ['устану', 'устанешь', 'устанет', 'устанем', 'устанете', 'устанут']},
    {base: 'читать', ru: ['читаю', 'читаешь', 'читает', 'читаем', 'читаете', 'читают']},

    // lekcja 5
    {base: 'обедать', ru: ['обедаю', 'обедаешь', 'обедает', 'обедаем', 'обедаете', 'обедают']},
    {base: 'делать', ru: ['делаю', 'делаешь', 'делает', 'делаем', 'делаете', 'делают']},
    {base: 'входить', ru: ['вхожу', 'входишь', 'входит', 'входим', 'входите', 'входят']},
    {base: 'пить', ru: ['пью', 'пьёшь', 'пьёт', 'пьём', 'пьёте', 'пьют']},
    {base: 'звонить', ru: ['звоню', 'звонишь', 'звонит', 'звоним', 'звоните', 'звонят']},
    {base: 'мочь', ru: ['могу', 'можешь', 'может', 'можем', 'можете', 'могут']},
    {base: 'написать', ru: ['напишу', 'напишешь', 'напишет', 'напишем', 'напишете', 'напишут']},
    {base: 'познакомиться', ru: ['познакомлюсь', 'познакомишься', 'познакомится', 'познакомимся', 'познакомитесь', 'познакомятся']},
    {base: 'показать', ru: ['покажу', 'покажешь', 'покажет', 'покажем', 'покажете', 'покажут']},
    {base: 'поставить', ru: ['поставлю', 'поставишь', 'поставит', 'поставим', 'поставите', 'поставят']},
    {base: 'просить', ru: ['прошу', 'просишь', 'просит', 'просим', 'просите', 'просят']},
    {base: 'рассказывать', ru: ['рассказываю', 'рассказываешь', 'рассказывает', 'рассказываем', 'рассказываете', 'рассказывают']},
    {base: 'сказать', ru: ['скажу', 'скажешь', 'скажет', 'скажем', 'скажете', 'скажут']},
    {base: 'хотеть', ru: ['хочу', 'хочешь', 'хочет', 'хотим', 'хотите', 'хотят']},

    // lekcja 6
    {base: 'есть', ru: ['ем', 'ешь', 'ест', 'едим', 'едите', 'едят']},
    {base: 'готовить', ru: ['готовлю', 'готовишь', 'готовит', 'готовим', 'готовите', 'готовят']},
    {base: 'испечь', ru: ['испеку', 'испечёшь', 'испечёт', 'испечём', 'испечёте', 'испекут']},
    {base: 'научить', ru: ['научу', 'научишь', 'научит', 'научим', 'научите', 'научат']},
    {base: 'попробовать', ru: ['попробую', 'попробуешь', 'попробует', 'попробуем', 'попробуете', 'попробуют']},
    {base: 'предлагать', ru: ['предлагаю', 'предлагаешь', 'предлагает', 'предлагаем', 'предлагаете', 'предлагают']},
    {base: 'резать', ru: ['режу', 'режешь', 'режет', 'режем', 'режете', 'режут']},

]